In [1]:
import pandas as pd

data_pria = pd.read_csv('nama_jenis_kelamin_laki.csv')
data_pria.head()

     Nama Jenis Kelamin
0     Aam   ♂ Laki-laki
1    Aang   ♂ Laki-laki
2  Aarief   ♂ Laki-laki
3    Abba   ♂ Laki-laki
4   Abbie   ♂ Laki-laki

In [2]:
data_wanita = pd.read_csv('nama_jenis_kelamin_perempuan.csv')
data_wanita.sample(10)

          Nama Jenis Kelamin
945   Matahari   ♀ Perempuan
972     Melina   ♀ Perempuan
951     Mayana   ♀ Perempuan
1433   Romansa   ♀ Perempuan
1511     Septa   ♀ Perempuan
1245      Puja   ♀ Perempuan
1106      Nini   ♀ Perempuan
1179      Nyna   ♀ Perempuan
1113   Nirmala   ♀ Perempuan
62      Amande   ♀ Perempuan

In [3]:
data_pria.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1777 entries, 0 to 1776
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Nama           1777 non-null   object
 1   Jenis Kelamin  1777 non-null   object
dtypes: object(2)
memory usage: 27.9+ KB

In [4]:
data_pria['Jenis Kelamin'].value_counts()

Jenis Kelamin
♂ Laki-laki    1777
Name: count, dtype: int64

In [5]:
data_pria['Jenis Kelamin'] = data_pria['Jenis Kelamin'].str.replace('♂ Laki-laki', 'Laki-Laki')

In [6]:
data_pria.sample(7)

            Nama Jenis Kelamin
340         Boni     Laki-Laki
1654     Waskita     Laki-Laki
486   Edisaputra     Laki-Laki
749         Imam     Laki-Laki
867        Karno     Laki-Laki
1436     Sayudha     Laki-Laki
1731       Yohan     Laki-Laki

In [7]:
data_pria['Jenis Kelamin'].value_counts()

Jenis Kelamin
Laki-Laki    1777
Name: count, dtype: int64

In [8]:
data_wanita.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1851 entries, 0 to 1850
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Nama           1851 non-null   object
 1   Jenis Kelamin  1851 non-null   object
dtypes: object(2)
memory usage: 29.0+ KB

In [9]:
data_wanita['Jenis Kelamin'].value_counts()

Jenis Kelamin
♀ Perempuan    1851
Name: count, dtype: int64

In [10]:
data_wanita['Jenis Kelamin'] = data_wanita['Jenis Kelamin'].str.replace('♀ Perempuan', 'Perempuan')
data_wanita.sample(7)

             Nama Jenis Kelamin
1707       Viyona     Perempuan
1255        Puspa     Perempuan
281         Cindy     Perempuan
679      Irmawati     Perempuan
810   Kusbandiyah     Perempuan
837        Lastri     Perempuan
1130     Novalind     Perempuan

In [11]:
data_wanita['Jenis Kelamin'].value_counts()

Jenis Kelamin
Perempuan    1851
Name: count, dtype: int64

In [13]:
data = pd.concat([data_pria, data_wanita])
data.head()

     Nama Jenis Kelamin
0     Aam     Laki-Laki
1    Aang     Laki-Laki
2  Aarief     Laki-Laki
3    Abba     Laki-Laki
4   Abbie     Laki-Laki

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3628 entries, 0 to 1850
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Nama           3628 non-null   object
 1   Jenis Kelamin  3628 non-null   object
dtypes: object(2)
memory usage: 85.0+ KB

In [16]:
data['Jenis Kelamin'].value_counts()

Jenis Kelamin
Perempuan    1851
Laki-Laki    1777
Name: count, dtype: int64

In [18]:
data.to_csv('data.csv', index=False)
data.to_excel('data.xlsx', index=False)

In [28]:
data.sample(10)

          Nama Jenis Kelamin
1025   Murwani     Perempuan
626      Graha     Laki-Laki
140     Andika     Laki-Laki
244   Budiyani     Perempuan
604     Hening     Perempuan
1181  Oktarian     Perempuan
1157      Pria     Laki-Laki
1093   Niandra     Perempuan
1267     Raski     Laki-Laki
321     Defara     Perempuan